問題文
数字からなる文字列 
S が与えられます。

以下の条件を全て満たす文字列 
T を 1122文字列 と呼びます。（定義は F 問題と同じです。）

T は数字からなる空でない文字列
∣T∣ は偶数。ここで、 
∣T∣ は文字列 
T の長さを表す
T の 
1 文字目から 
2
∣T∣
​
  文字目までは全て同じ数字である
T の 
2
∣T∣
​
 +1 文字目から 
∣T∣ 文字目までは全て同じ数字である
T の 
1 文字目の数字に 
1 を足すと 
∣T∣ 文字目の数字になる
例えば 1122 や 01 、 444555 などは 1122文字列 ですが、 1222 や 90 は 1122文字列 ではありません。

S の 部分文字列 であって 1122文字列 であるものの個数を求めてください。

ただし、ある二つの部分文字列が文字列として同じでも、取り出された位置が異なるならばそれらは別々に数えるものとします。

制約
S は長さ 
1 以上 
10 
6
  以下の数字からなる文字列S = [int(n) for n in input()]

seqback = 1
seqafter = 0


b = 0#ひとつ前

ans = 0

for i in range(len(S)):
  if i == 0:
    b = S[i]
  
  else:
    if b == S[i]:
      seqback += 1
      seqafter += 1
      
    elif S[i] == b+1:#連続ストップして次の数字が+1の値
      #seqback = 0#左の連続カウントリセット
      ans += 1
      seqafter += 1#右の連続カウントスタート
      
    elif S[i] != b+1:#次の数字が+1になっていない
      seqback = 0
      seqback += 1
      
    b = S[i]#過去の人にする
    if seqback == seqafter:
      ans += min(seqback,seqafter)
      seqback = seqafter#右にカウントしていたものを左カウントに持っていく
      seqafter = 0
